Revit 2026 API

# PrintSetupRevert Method

---

Revert the current print setting.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Revert()
```
```vb
Public Sub Revert
```
```cpp
public:
void Revert()
```
```fsharp
member Revert : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the current print setting is In-Session. |

#### Reference

PrintSetup Class

Autodesk.Revit.DB Namespace